{"id":1801,"date":"2020-09-07T18:00:46","date_gmt":"2020-09-07T17:00:46","guid":{"rendered":"https:\/\/temp.susodigital.com\/textbook\/?post_type=module&#038;p=1801"},"modified":"2020-09-07T10:17:25","modified_gmt":"2020-09-07T09:17:25","slug":"the-fundamentals-of-link-building","status":"publish","type":"module","link":"https:\/\/susodigital.com\/textbook\/module\/establishing-authority\/the-fundamentals-of-link-building","title":{"rendered":"The Fundamentals of Link Building"},"featured_media":0,"parent":415,"menu_order":71,"template":"","acf":{"module_quiz":"","module_time":"24","module_difficulty":{"value":"easy","label":"Easy"},"module_short_description":"<p>Looking at the fundamentals of link building.<\/p>\n","module_long_description":"<p>In this chapter we highlight the fundamentals of link building including what it is, why it's important and how to build links in a Google-friendly way.<\/p>\n","video_file":false,"video_url":"","content":"<p><span style=\"font-weight: 400;\">In this chapter, we will focus on the basics of link building before taking a look at why you should spend time on it if you’re doing SEO for your site, and how it affects your site&#8217;s performance in the search results.<\/span><\/p>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1804\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-FUMDAMENTALS-OF-LINK-BUILDING.jpg\" alt=\"\" width=\"1426\" height=\"1006\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-FUMDAMENTALS-OF-LINK-BUILDING.jpg 1426w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-FUMDAMENTALS-OF-LINK-BUILDING-57x40.jpg 57w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-FUMDAMENTALS-OF-LINK-BUILDING-113x80.jpg 113w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-FUMDAMENTALS-OF-LINK-BUILDING-43x30.jpg 43w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-FUMDAMENTALS-OF-LINK-BUILDING-85x60.jpg 85w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-FUMDAMENTALS-OF-LINK-BUILDING-34x24.jpg 34w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-FUMDAMENTALS-OF-LINK-BUILDING-68x48.jpg 68w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-FUMDAMENTALS-OF-LINK-BUILDING-26x18.jpg 26w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-FUMDAMENTALS-OF-LINK-BUILDING-51x36.jpg 51w\" sizes=\"(max-width: 1426px) 100vw, 1426px\" \/>\n<h2>What Is Link Building?<\/h2>\n<p>Simply put, link building is the processing of securing hyperlinks (or backlinks) from external websites to your own. The idea here is to capitalise on the fact that search engines use links to navigate and crawl the web. Link building (often referred to as off-page SEO), is one of the most important factors when it comes to SEO and there are several techniques SEOs employ in order to secure links for their website.<\/p>\n<h2>Why Is Link Building Important?<\/h2>\n<p>Links represent the connections you make with other entities online, and they are a huge part of how Google decides what authority your site has compared to all the others that exist in the same niche.<\/p>\n<p>Having great backlinks also gets you:<\/p>\n<p><strong>Referral Traffic<\/strong> &#8211; by mentioning you as a source of information, people will click on the link and visit your site in order to find out more.<\/p>\n<p><strong>Higher Authority<\/strong> &#8211; what does having authority mean? If you look in the dictionary, you’ll see that a person who has authority is “a person with extensive or specialized knowledge about a subject: an expert” &#8211; in this case, each link you get will confirm that you are a good source to go to for that type of information. The more good quality websites say that you are an authority on the subject, the more trustworthy you will become in your field.<\/p>\n<p>Naturally, the more authoritative the site you’re getting backlinks from, the more authority they can transfer on to you. This is why targeting great quality sites for outreach is so important.<\/p>\n<p><strong>PageRank<\/strong> &#8211; PageRank is an original algorithm used by Google in order to rank pages, and to state what the importance of a specific page is when compared to others. The name of this algorithm actually refers to one of Google’s founders &#8211; Larry Page. Not a web page.<\/p>\n<p>Although we still use the term PageRank, the fact is that Google now uses a complex network of algorithms in order to rank a website’s importance. These algorithms’ goal is to make the perfect match between user intent and what page best fits that intent.<\/p>\n<p>It’s all about what the user needs. Links embedded in specific types of content will add to your site’s PageRank, and affect the complex system of how search results are managed.<\/p>\n<p>PageRank is calculated on a page by page basis, NOT by domain authority.<\/p>\n<h2>What Makes a Link “Good”?<\/h2>\n<p><strong>Follow vs Nofollow<\/strong> &#8211; before we get any further, let’s talk about the very basics of link anatomy.<\/p>\n<p>Below, is an example of how a hyperlink is coded in its most basic form on a web page using HTML.<\/p>\n<pre><span style=\"color: #ff0000;\">&lt;a<\/span> <span style=\"color: #ff9900;\">href=”<u>https:\/\/susodigital.com\/<\/u>”&gt;<\/span> <span style=\"color: #333399;\">SUSO Digital<\/span> <span style=\"color: #ff00ff;\">&lt;\/a&gt;<\/span><\/pre>\n<p><span style=\"color: #ff0000;\">Open Link Tag<\/span>: Referred to as an “anchor” tag, this tells the search engine that there will be a link to another resource.<\/p>\n<p><span style=\"color: #ff9900;\">Link Resource Location<\/span>: The “href” property stands for “hyperlink referral” and the text inside the quotation marks serves as the address that the link is pointing towards. This can be the address of another web page, image or a file.<\/p>\n<p><span style=\"color: #333399;\">Anchor Text<\/span>: This is the clickable text that the user is able to see on the web page. When clicked, the user is directed to the Link Resource Location<\/p>\n<p><span style=\"color: #ff00ff;\">Close Link Tag<\/span>: This tells the search engines that the link has been closed.<\/p>\n<p>When it comes to SEO, we have seen in previous modules that there are two types of links that instruct the search engine on how to treat each link, they are: “dofollow” and “nofollow”.<\/p>\n<p>If there is a “rel=nofollow” tag at the end of a link, it means that the link is not passing on any authority and as a result offers no SEO value.<\/p>\n<pre>&lt;a href=”<u>https:\/\/susodigital.com\/<\/u>” <strong>rel=\"nofollow\"<\/strong>&gt; SUSO Digital &lt;\/a&gt;<\/pre>\n<p>You can check the code in a link simply by left clicking on the link and seeing what the code is.<\/p>\n<h2>A Little Link Building History<\/h2>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1805\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Little-Link-Building-History.jpg\" alt=\"\" width=\"1426\" height=\"1006\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Little-Link-Building-History.jpg 1426w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Little-Link-Building-History-57x40.jpg 57w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Little-Link-Building-History-113x80.jpg 113w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Little-Link-Building-History-43x30.jpg 43w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Little-Link-Building-History-85x60.jpg 85w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Little-Link-Building-History-34x24.jpg 34w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Little-Link-Building-History-68x48.jpg 68w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Little-Link-Building-History-26x18.jpg 26w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Little-Link-Building-History-51x36.jpg 51w\" sizes=\"(max-width: 1426px) 100vw, 1426px\" \/>\n<p>In the 90’s the internet was basically like the Wild West &#8211; whoever hacked, cheated and strong-armed their way to the top was noticed. This didn’t make for a good user experience, because it led to spam. A lot of spam.<\/p>\n<p>A lot of businesses would stuff their sites so full of keywords that it would render them unreadable. Practices like hidden links, invisible text, link stuffing with spam.<\/p>\n<p>Google started to introduce algorithm updates in order to combat spam and poor business practices. In other words, to make the internet browsable again. This is why black hat practices aren’t good and they never were &#8211; eventually, Google is going to shut it down.<\/p>\n<p><strong>rel=”nofollow”<\/strong> &#8211; In 2005, <a href=\"https:\/\/support.google.com\/webmasters\/answer\/96569?hl=en\" target=\"_blank\" rel=\"nofollow noopener\">Google introduced<\/a> the “nofollow” tag in order to further cut down on link building spam. SEO started to become more user focused and content friendly &#8211; Google was winning the quality game. The “nofollow” tag meant that you couldn’t spam places like forums and comment sections with links anymore.<\/p>\n<p><strong>rel=”sponsored”<\/strong> &#8211; Similarly, paid links are marked as rel=&#8221;sponsored&#8221;. This is so it’s clearly marked who paid for a link and that it’s a “sponsored post” &#8211; it won’t pass along the same kind of authority.<\/p>\n<p><strong>rel=”ugc”<\/strong> &#8211; Another tag to be on the lookout for is the “rel=ugc” &#8211; here, links that are made in user generated content can be marked. Sometimes, if the contributor is especially valuable and a website wants to be associated with him or her and pass the link juice along, they will remove this tag. This is why building solid and valuable relationships can pay off. It’s worth pointing out that it’s not about every content created by users, but more about the comments or reviews in places like product pages.<\/p>\n<p>Every once in a while, someone will say that link building won’t matter soon &#8211; but judging by the trends that have been happening in every algorithm update that’s not the case &#8211; rather, Google is only getting better at recognizing useful links that give value and improve user experience. It’s only natural that these links would have a hand in improving the brand’s authority.<\/p>\n<p>According to Search Engine Land, links and content are still some of the most important signals for ranking a page. While the way they’re being taken into consideration is becoming stricter, concentrating on getting high-quality links is a great incentive for improving the overall quality of content on the web.<\/p>\n<h2>Link Building Strategies<\/h2>\n<p>You don’t have to start from scratch when you start prospecting. There are some tried and proven-to-work strategies that you can employ in order to get links. Remember that the SEO landscape can change fast, and strategies that were rewarding and effective some years ago can potentially be problematic and get you into Google jail today.<\/p>\n<p>Before we start on strategies, we’d like to remind you of some link building strategies that you should avoid, these are often referred to as “black hat” techniques because they do not follow Google’s guidelines when it comes to link building.<\/p>\n<h3>Link Building Strategies to Avoid<\/h3>\n<h4>PBNs<\/h4>\n<p>A PBN is a Private Blog Network &#8211; this can be a network of websites or blogs (and directories) that make their money exclusively from selling links. Their websites will often be a collection of badly written content, and all niches jammed together into a topic salad. Poor content generates poor traffic. Their menu will most likely be made up of genres like: Self care, tech, pop culture, health, gadgets, exercise, politics, travel, beauty &#8211; with cannabis articles thrown into random places just for fun.<\/p>\n<p>Sometimes, they will be better designed and niche specific &#8211; only after you submit a pitch and get back the answer will you smell something fishy going on &#8211; you will get a list of anywhere from 10 to 100 “affiliated” websites that you can also post on &#8211; for a fee. Some of these sites might look very tempting &#8211; but don’t do it! It might not get you a penalty but it will simply be an “ignored” link. Why waste the time and effort?<\/p>\n<h4>Over-Optimised Link Building<\/h4>\n<p>Too much keyword optimisation can also be a bad thing &#8211; in 2020 there are a lot of SEO experts that say “let the people choose” &#8211; meaning letting the prospects choose a natural sounding anchor will be better for you in the long run.<\/p>\n<p>The addition of <a href=\"https:\/\/blog.google\/products\/search\/search-language-understanding-bert\/\" target=\"_blank\" rel=\"nofollow noopener\">BERT<\/a> has helped Google understand language better, and process people’s intent &#8211; and what’s most important, understand the context behind a word. As understanding search queries becomes more organic, so will the understanding of the context of anchor texts. In this new world, optimized anchors will become painfully obvious, and it does not look like a natural link profile.<\/p>\n<h4>Write For Us<\/h4>\n<p>Sometimes, websites will go out of their way to invite site owners to provide their own content in exchange for a hyperlink. Most of the time, it means they are a PBN or get a part of their income from selling links. This is also a big “no” because it violates Google’s guidelines on acquiring links “naturally”.<\/p>\n<h3>Recommended Link Building Strategies<\/h3>\n<h4>Blogger Outreach<\/h4>\n<p>Outreaching to genuine bloggers that have experience and authority in their niche. You can build a relationship with them and put together content that really ranks. We will go into more detail on how to conduct blogger outreach later on in this module.<\/p>\n<h4>Broken Link Building<\/h4>\n<p>Searching great quality sites for broken links &#8211; that used to point to other niche pages but no longer exist. You can point out the broken link in your email, and offer a page with similar content on your site &#8211; hopefully content that is up to date and well written. It’s good to look for links that have been neglected by your competitors.<\/p>\n<p>As you can see here, Ahrefs.com even has a free tool you can use to monitor the broken links on your own site.<\/p>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1806\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Broken-Links.jpg\" alt=\"\" width=\"1305\" height=\"505\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Broken-Links.jpg 1305w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Broken-Links-103x40.jpg 103w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Broken-Links-207x80.jpg 207w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Broken-Links-78x30.jpg 78w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Broken-Links-155x60.jpg 155w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Broken-Links-62x24.jpg 62w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Broken-Links-124x48.jpg 124w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Broken-Links-47x18.jpg 47w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Broken-Links-93x36.jpg 93w\" sizes=\"(max-width: 1305px) 100vw, 1305px\" \/>\n<p>You can also find what external backlinks point to any broken pages on your website. Fixing those will help you a lot.<\/p>\n<p><strong>Finding Broken Backlinks<\/strong><\/p>\n<p>Enter your website address into Ahrefs, and click on the “Broken” option under “Backlinks” in the left hand side.<\/p>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1806\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Broken-Links.jpg\" alt=\"\" width=\"1305\" height=\"505\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Broken-Links.jpg 1305w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Broken-Links-103x40.jpg 103w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Broken-Links-207x80.jpg 207w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Broken-Links-78x30.jpg 78w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Broken-Links-155x60.jpg 155w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Broken-Links-62x24.jpg 62w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Broken-Links-124x48.jpg 124w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Broken-Links-47x18.jpg 47w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Broken-Links-93x36.jpg 93w\" sizes=\"(max-width: 1305px) 100vw, 1305px\" \/> <img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1807\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Fiding-Broken-Backlinks.png\" alt=\"\" width=\"1050\" height=\"377\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Fiding-Broken-Backlinks.png 1050w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Fiding-Broken-Backlinks-111x40.png 111w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Fiding-Broken-Backlinks-223x80.png 223w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Fiding-Broken-Backlinks-84x30.png 84w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Fiding-Broken-Backlinks-167x60.png 167w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Fiding-Broken-Backlinks-67x24.png 67w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Fiding-Broken-Backlinks-134x48.png 134w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Fiding-Broken-Backlinks-50x18.png 50w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Fiding-Broken-Backlinks-100x36.png 100w\" sizes=\"(max-width: 1050px) 100vw, 1050px\" \/>\n<p>To find a competitor’s broken backlinks, do the same but with your competitor’s address.<\/p>\n<p>If you’re a bakery, you may see that there are a lot of links pointing to a competitor’s broken chocolate chip cookie recipe. Compile a list of those websites and reach out to them with a working page that contains a better recipe with a vegan option &#8211; you might have just earned yourself a lot of backlinks AND organic traffic.<\/p>\n<h4>Brand Mentions<\/h4>\n<p>Is your brand already pretty well known in your niche or locality?<\/p>\n<p>Take a look if there are people already talking about you &#8211; mentioning your products or services. You can find who is mentioning you by using the “Content Explorer”.<\/p>\n<p>Make a list of your branded products or services, or if you’re a business owner &#8211; even your own name. Enter it into the content explorer, and you will have a list of places where it’s mentioned &#8211; easy!<\/p>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1808\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Brand-Metions.png\" alt=\"\" width=\"1889\" height=\"660\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Brand-Metions.png 1889w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Brand-Metions-1536x537.png 1536w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Brand-Metions-114x40.png 114w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Brand-Metions-229x80.png 229w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Brand-Metions-86x30.png 86w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Brand-Metions-172x60.png 172w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Brand-Metions-69x24.png 69w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Brand-Metions-137x48.png 137w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Brand-Metions-52x18.png 52w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Brand-Metions-103x36.png 103w\" sizes=\"(max-width: 1889px) 100vw, 1889px\" \/>\n<p>*Tip &#8211; it’s a good idea to use a quality filter, so you only see pages that have high authority.<\/p>\n<div class=\"tip d-flex align-items-center bg-suso-white\"><svg class=\"tip__icon d-block text-dark-blue line-height-1-5\" enable-background=\"new 0 0 29 37\" viewBox=\"0 0 29 37\" xmlns=\"http:\/\/www.w3.org\/2000\/svg\"><g fill=\"#18217e\" opacity=\".5\"><path d=\"m28.6 26.2-2-3.2c-.2-.3-.3-.7-.3-1l-.7-10.6c-.4-5.7-4.8-10.2-10.5-10.7-6.1-.3-11.3 4.3-11.7 10.4l-.7 10.9c0 .4-.1.7-.3 1l-2 3.1c-.4.7-.5 1.5-.1 2.3.4.7 1.1 1.2 1.9 1.2h24.5c.8 0 1.6-.4 1.9-1.1.4-.8.4-1.6 0-2.3z\"\/><path d=\"m17 31.8c.5 0 1 .3 1.3.7.3.5.3 1 0 1.5-.8 1.4-2.3 2.2-3.8 2.2s-3-.8-3.8-2.2c-.3-.5-.3-1 0-1.5s.7-.7 1.3-.7z\"\/><\/g><\/svg><div class=\"entry-content\">it’s a good idea to use a quality filter, so you only see pages that have high authority.<\/div><\/div>\n<p>Here is the ABC of finding great opportunities for brand mentions:<\/p>\n<div class=\"list-styles list-styles__circle list-styles__circle--primary-color\"><ul>\n<li>Make a list of products specific to your company. For example, a company like See’s Candies would look for the terms “See&#8217;s Candy” but chocolate truffles, See’s chocolate gift boxes, chocolate gift sets. Anything that they can think of that’s related to what they do.<\/li>\n<li>Don’t hesitate to use the name of business owners or partners. Whenever they’re mentioned online, their business can be too. This can earn you a lot of links quickly.<\/li>\n<li>Look for these terms in content explorer, making sure that you’re only looking for results that aren’t linked to your business:<\/li>\n<\/ul>\n<\/div>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1810\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Brand-Metions_2.jpg\" alt=\"\" width=\"1196\" height=\"298\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Brand-Metions_2.jpg 1196w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Brand-Metions_2-161x40.jpg 161w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Brand-Metions_2-321x80.jpg 321w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Brand-Metions_2-120x30.jpg 120w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Brand-Metions_2-241x60.jpg 241w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Brand-Metions_2-96x24.jpg 96w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Brand-Metions_2-193x48.jpg 193w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Brand-Metions_2-72x18.jpg 72w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Brand-Metions_2-144x36.jpg 144w\" sizes=\"(max-width: 1196px) 100vw, 1196px\" \/>\n<div class=\"list-styles list-styles__circle list-styles__circle--primary-color\"><ul>\n<li>Once you have built up a good list of these results, preferably on a spreadsheet, you can plan an email campaign to the publishers of the articles that mention your brand or product. This is easier than a cold email, since they are already mentioning you or your products, and most publishers will be happy to link in this case.<\/li>\n<\/ul>\n<\/div>\n<h4>Topic Mention\/Resource Sharing<\/h4>\n<p>You can use the same strategy as above if you have a valuable resource that bloggers can use to support their article. For example, if you’re a garden supply store and you have a tool like a planting and harvest calculator, you can look for articles on planting and harvesting &#8211; reach out to them and tell them all about your tool. It’s not spammy, but helpful and insightful, and this is how today’s SEO should be done.<\/p>\n<h4>Competitor Analysis<\/h4>\n<p>Sometimes, your competitors are a lot better than you at targeting the right websites. Chances are, that these websites will also give you a link if you approach them correctly.<\/p>\n<p>The best tool for this is, again, Ahrefs. Other tools that can be helpful are the ones built especially for Outreach, like Pitchbox.<\/p>\n<p>This takes some reverse engineering and seeing how your competitor got the link in the first place &#8211; did they write great content? Did they share an infographic? You can try to replicate this method for yourself.<\/p>\n<p>Here are the competitors for See’s:<\/p>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1811\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-competitor-analisys.jpg\" alt=\"\" width=\"1215\" height=\"601\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-competitor-analisys.jpg 1215w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-competitor-analisys-81x40.jpg 81w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-competitor-analisys-162x80.jpg 162w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-competitor-analisys-61x30.jpg 61w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-competitor-analisys-121x60.jpg 121w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-competitor-analisys-49x24.jpg 49w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-competitor-analisys-97x48.jpg 97w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-competitor-analisys-36x18.jpg 36w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-competitor-analisys-73x36.jpg 73w\" sizes=\"(max-width: 1215px) 100vw, 1215px\" \/>\n<p>As you can see, there are a lot of them &#8211; each one of them has an amazing list of backlinks, if we only look. This is usually a goldmine of potential prospects, and if you’re doing it manually, it might take some time to filter. You should filter by:<\/p>\n<div class=\"list-styles list-styles__circle list-styles__circle--primary-color\"><ul>\n<li>Tags<\/li>\n<li>Page authority<\/li>\n<\/ul>\n<\/div>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1812\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Competitor-Analysis_2.jpg\" alt=\"\" width=\"1171\" height=\"509\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Competitor-Analysis_2.jpg 1171w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Competitor-Analysis_2-92x40.jpg 92w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Competitor-Analysis_2-184x80.jpg 184w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Competitor-Analysis_2-69x30.jpg 69w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Competitor-Analysis_2-138x60.jpg 138w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Competitor-Analysis_2-55x24.jpg 55w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Competitor-Analysis_2-110x48.jpg 110w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Competitor-Analysis_2-41x18.jpg 41w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/12-Competitor-Analysis_2-83x36.jpg 83w\" sizes=\"(max-width: 1171px) 100vw, 1171px\" \/>\n"},"_links":{"self":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/1801"}],"collection":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules"}],"about":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/types\/module"}],"version-history":[{"count":0,"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/1801\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/415"}],"wp:attachment":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/media?parent=1801"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}